docs/overview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-26 Tue 16:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Overview</title>
<meta name="author" content="Sam Neaves" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="styles.css">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="overview.html"> UP </a>
 |
 <a accesskey="H" href=""> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Overview</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org17bd8d8">1. Introduction</a></li>
<li><a href="#org0c3b367">2. Code Organization</a>
<ul>
<li><a href="#orgf46439a">2.1. Code Accessibility and Literate Programming</a></li>
<li><a href="#orgdedae7d">2.2. File Formats and Visualization</a></li>
<li><a href="#org1b92137">2.3. Accessing the Files</a></li>
</ul>
</li>
<li><a href="#org813e737">3. Data</a>
<ul>
<li><a href="#orgd376d92">3.1. <span class="todo TODO">TODO</span> [INSERT DETALS OF SEQUENCING TECH OR REFERNCE]</a></li>
</ul>
</li>
<li><a href="#org041674b">4. System biology approach</a>
<ul>
<li><a href="#org339cccc">4.1. Intreptation of sequence data as instances in state space.</a></li>
</ul>
</li>
<li><a href="#org3158826">5. Analysis Steps</a>
<ul>
<li><a href="#org7a11617">Step 1. Get the prior knowledge network</a></li>
<li><a href="#org9f41200">Step 2. Basic properties of single cell data and prior knowledge network</a></li>
<li><a href="#org8a5bd90">Step 3. Subgroup discovery of cellular states</a></li>
<li><a href="#org667abd9"><span class="todo TODO">TODO</span> Step 4. Sign Consitency Modeling</a></li>
<li><a href="#orgc6dbf67"><span class="todo TODO">TODO</span> Step 5.  Boolean network modeling</a></li>
<li><a href="#org1dee4cb"><span class="todo TODO">TODO</span> Step 6.  Counterfactual Reasoning</a></li>
</ul>
</li>
<li><a href="#org549f280">6. Nextflow execution</a>
<ul>
<li><a href="#orgd9836b1">6.1. <span class="todo TODO">TODO</span> add code and instructions for nextflow execution</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="navigation"> <div id="mytitle"><h1>ParkinsonPathAI (Working title) - AI Models for Pathway Analysis in Parkinson’s Disease</h1></div>
<ul class="org-ul">
<li><a href="overview.html">Overview</a></li>
<li><a href="get_prior_knowledge_network.html">Get prior knowledge network</a></li>
<li><a href="initial_exploration_and_extraction.html">Initial Data Exploration and Data Extraction</a></li>
<li><a href="cell_state_subgroup_discover.html">Cell State Subgroup Discovery</a></li>
<li><a href="cell_state_subgroup_discover.html">Cell State Subgroup Discovery2</a></li>
</ul>
</div>



<div id="outline-container-org17bd8d8" class="outline-2">
<h2 id="org17bd8d8"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This project focuses on analyzing single-cell transcriptomic data from
brain cells of both control and Parkinson’s disease donors. Our goal
is to characterize the complex interplay between the RAS and dopamine
pathways, we will attempt to do this using symbolic AI techniques. By employing methods like
descriptive rule induction, causal analysis, and model
building/repair, we aim to identify and understand unique cell states
associated with Parkinson’s disease.
</p>

<p>
Our approach reconciles gene networks with experimental data, allowing
us to reason about network consistency and potentially discover key
molecular signatures involved in disease progression. This repository will
contain code, data preprocessing steps, and model implementation
details for this exploratory analysis.
</p>

<p>
This is an open scientific project, actively developed in the
open-source community and a continuous work in progress. As the
results are preliminary, they may evolve over time with further
analysis and validation. If you spot any errors or have suggestions,
please feel free to open an issue. Contributions and feedback from the
community are welcome to help improve and refine our understanding of
the RAS and dopamine pathways in Parkinson’s disease.
</p>
</div>
</div>

<div id="outline-container-org0c3b367" class="outline-2">
<h2 id="org0c3b367"><span class="section-number-2">2.</span> Code Organization</h2>
<div class="outline-text-2" id="text-2">
<p>
This project is hosted on GitHub and follows a clear and structured
approach to organizing code and documentation.
</p>
</div>

<div id="outline-container-orgf46439a" class="outline-3">
<h3 id="orgf46439a"><span class="section-number-3">2.1.</span> Code Accessibility and Literate Programming</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The code is written in a
<a href="https://en.wikipedia.org/wiki/Literate_programming">literate programming style</a> , integrating code
and explanatory prose. This approach enhances readability and provides
clear context for each step in the analysis. The primary medium for
this documentation is <a href="https://orgmode.org/">Emacs Org mode files</a> , which resemble Markdown
but offer several additional features, including:
</p>

<ul class="org-ul">
<li>Advanced Formatting: Support for tables, source code blocks, and
inline evaluation of code.</li>

<li>Integration with Analysis: Directly execute embedded code blocks.</li>

<li>Export Capabilities: Generate various formats like HTML, PDF, and
plain text from the same source file.</li>

<li>Tangled Scripts and Workflow Execution</li>
</ul>
<p>
From these Org files, tangled scripts are generated. Tangling extracts
the source code blocks into standalone scripts, enabling flexible
execution:
</p>


<ul class="org-ul">
<li>Step-by-Step Execution: Run individual scripts to focus on specific
parts of the analysis. This is especially useful if you are
interested in a single stage of the workflow.</li>

<li>Pipeline Execution: The tangled scripts are also integrated into a
Nextflow pipeline, allowing the entire workflow to be executed in
one process. The Nextflow execution enhances reproducibilty,
portabilty and scalabilty of the code.</li>
</ul>
</div>
</div>


<div id="outline-container-orgdedae7d" class="outline-3">
<h3 id="orgdedae7d"><span class="section-number-3">2.2.</span> File Formats and Visualization</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The Org files are plain text and can be viewed or edited in any text
editor. However, to improve accessibility and provide a visually
appealing presentation, the Org files are exported to HTML and hosted
on GitHub Pages. This HTML version enhances the user experience by
incorporating multimedia elements like images, links, and interactive
visualizations.
</p>
</div>
</div>


<div id="outline-container-org1b92137" class="outline-3">
<h3 id="org1b92137"><span class="section-number-3">2.3.</span> Accessing the Files</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Org File: The main Org file for this project is located at: [Link to Org file].</li>
<li>HTML View: The corresponding HTML version can be accessed here: [Link to GitHub Pages].</li>
</ul>
<p>
This organization ensures that the code is both transparent and
user-friendly, making it easy for collaborators to understand,
replicate, and extend the analysis.
</p>
</div>
</div>
</div>


<div id="outline-container-org813e737" class="outline-2">
<h2 id="org813e737"><span class="section-number-2">3.</span> Data</h2>
<div class="outline-text-2" id="text-3">
<p>
Biological cell samples were collected postmortem from the ventral
substantia nigra of seven control samples, nine Parkinson's disease
samples, and four samples from patients with Incidental Lewy Body
Disorder. The nuclei of these cells were extracted and sequenced,
totaling 23,885 nuclei. The sequecning was deep and full
length.
</p>
</div>
<div id="outline-container-orgd376d92" class="outline-3">
<h3 id="orgd376d92"><span class="section-number-3">3.1.</span> <span class="todo TODO">TODO</span> [INSERT DETALS OF SEQUENCING TECH OR REFERNCE]</h3>
</div>
</div>

<div id="outline-container-org041674b" class="outline-2">
<h2 id="org041674b"><span class="section-number-2">4.</span> System biology approach</h2>
<div class="outline-text-2" id="text-4">
<p>
Our approach to this analysis is grounded in symbolic systems
biology. In systems biology, our goal is to understand and model
biological reality at a systems level. This means focusing on how
multiple aspects of biology interact to produce observable outcomes,
contrasting with traditional approaches that isolate individual
phenomena. Symbolic systems biology differs from quantitative systems
biology in the level of abstraction it applies.
</p>


<p>
Using discrete symbols to represent components of the system, rather
than specific quantities, offers several advantages. First,
abstracting measured data into symbolic form allows us to manage noise
in the data. Second, this abstraction reduces the size of the state
space we analyze, making certain computational methods more
feasible. Third, our goal is not only to understand the system but
also to control it. Therefore, it’s essential that our models and
their dynamics are interpretable, allowing suggested interventions and
their potential consequences to be validated in a laboratory setting.
</p>


<p>
Finally, there is evidence that symbolic abstraction is sufficient to
model biological dynamics in many cases.
</p>


<p>
Biological reality is highly complex. While the central dogma—DNA
transcribed to RNA, translated to protein—outlines the basic process
of cellular maintenance and control, the specifics of transcription,
translation, and metabolic pathways leading to disease are intricate
and require further exploration.
</p>


<p>
For instance, in somatic cells, DNA remains stable as cells
replicate. Differences between cells arise through processes such as
differentiation and gene regulation. Transcription can occur in
bursts, and alternative splicing allows for multiple proteins from a
single gene. Additionally, protein complexes may form with the aid of
chaperones, and epigenetic mechanisms, such as methylation and histone
modification, affect gene accessibility.
</p>
</div>


<div id="outline-container-org339cccc" class="outline-3">
<h3 id="org339cccc"><span class="section-number-3">4.1.</span> Intreptation of sequence data as instances in state space.</h3>
<div class="outline-text-3" id="text-4-1">
<p>
In our analysis of transcriptome from nuclei, previous work has
identified cell types using x method.
In addition cell states have been identified by y method.
</p>
</div>
</div>
</div>

<div id="outline-container-org3158826" class="outline-2">
<h2 id="org3158826"><span class="section-number-2">5.</span> Analysis Steps</h2>
<div class="outline-text-2" id="text-5">
<p>
The following litrate notebook constitute the analysis done in this
work. Each one contains code and prose explaining the work done.
</p>
</div>

<div id="outline-container-org7a11617" class="outline-3">
<h3 id="org7a11617">Step 1. Get the prior knowledge network</h3>
<div class="outline-text-3" id="text-org7a11617">
<p>
<a href="scripts/get_prior_knowledge_network.html">Get prior knowledge network steps</a>
</p>
</div>
</div>

<div id="outline-container-org9f41200" class="outline-3">
<h3 id="org9f41200">Step 2. Basic properties of single cell data and prior knowledge network</h3>
<div class="outline-text-3" id="text-org9f41200">
<p>
<a href="scripts/initial_exploration_and_extraction.html">Initial data exploration and extraction</a>
</p>
</div>
</div>

<div id="outline-container-org8a5bd90" class="outline-3">
<h3 id="org8a5bd90">Step 3. Subgroup discovery of cellular states</h3>
<div class="outline-text-3" id="text-org8a5bd90">
<p>
<a href="scripts/cell_state_subgroup_discover.html">Cell state subgroup discovery</a>
</p>
</div>
</div>

<div id="outline-container-org667abd9" class="outline-3">
<h3 id="org667abd9"><span class="todo TODO">TODO</span> Step 4. Sign Consitency Modeling</h3>
<div class="outline-text-3" id="text-org667abd9">
<p>
ho
</p>
</div>
</div>
<div id="outline-container-orgc6dbf67" class="outline-3">
<h3 id="orgc6dbf67"><span class="todo TODO">TODO</span> Step 5.  Boolean network modeling</h3>
<div class="outline-text-3" id="text-orgc6dbf67">
</div>
</div>


<div id="outline-container-org1dee4cb" class="outline-3">
<h3 id="org1dee4cb"><span class="todo TODO">TODO</span> Step 6.  Counterfactual Reasoning</h3>
<div class="outline-text-3" id="text-org1dee4cb">
</div>
</div>
</div>

<div id="outline-container-org549f280" class="outline-2">
<h2 id="org549f280"><span class="section-number-2">6.</span> Nextflow execution</h2>
<div class="outline-text-2" id="text-6">
<p>
If you just want to just run the analysis yourself you may want to
execute the code steps as part of the nextflow pipline.
</p>
</div>

<div id="outline-container-orgd9836b1" class="outline-3">
<h3 id="orgd9836b1"><span class="section-number-3">6.1.</span> <span class="todo TODO">TODO</span> add code and instructions for nextflow execution</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sam Neaves</p>
<p class="date">Created: 2024-11-26 Tue 16:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
